---
kind: method
id: M:Autodesk.Revit.Exceptions.CentralModelContentionException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
source: html/53cd7506-eaa4-4fda-bfc6-a7fbb8d76f48.htm
---
# Autodesk.Revit.Exceptions.CentralModelContentionException.GetObjectData Method

Retrieves data needed to serialize the target object.

## Syntax (C#)
```csharp
public override void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
```

## Parameters
- **info** (`System.Runtime.Serialization.SerializationInfo`) - Data needed to serialize or deserialize the object.
- **context** (`System.Runtime.Serialization.StreamingContext`) - The destination of the serialized stream.